Repository: caius-kong/mt
Catalog: data_clean/input/old.tmx
Source language: en_us
Languages: fr_fr

source: This&nbsp;task willdeploy NTRtScan.exe version 10.58.0.1016. This&nbsp;critical patchresolves the following issue: &nbsp;&nbsp; Issue:&nbsp;&nbsp;&nbsp; The Core Protection Module cannot apply automatic updates successfully. This issue occurs when the "IOT_InitializeDeviceAndScanEngineEx" VSAPI function returns a system busy error code while starting preventing the NTRtScan service from starting in some clients.&nbsp;&nbsp; Solution: Critical Patch&nbsp;0001 adds a retry mechanism for the "IOT_InitializeDeviceAndScanEngineEx" VSAPI function and enables NTRtScan to delay its startup process while it waits for the function to start successfully. This allows the NTRtScan service to start without issues and the Core Protection Module to apply automatic updates successfully. [Installation]&nbsp;&nbsp; ===================================================================== To install this critical patch: Run this fixlet to deploy "NTRtScan.exe" version 10.58.0.1016 to clients.&nbsp; The old "NTRtScan.exe" is saved as "NTRtScan.exe.tmp" in the "[Trend Micro folder]\OfficeScan Client\" folder. You can use this back up file for rollback purposes. [Uninstallation]&nbsp;&nbsp; =====================================================================&nbsp;&nbsp; To uninstall the fixlet, manually remove the fixlet through the Endpoint Security Platform console. &nbsp;&nbsp; To rollback to the previous "NTRtScan.exe" version:&nbsp;&nbsp; &nbsp;&nbsp; 1. Stop the NTRtScan service.&nbsp;&nbsp; &nbsp;&nbsp; 2. Check if the file "[Trend Micro folder]\OfficeScan Client\NTRtScan.exe.tmp" is existed. If so, remove the "[Trend Micro folder]\OfficeScan Client\&nbsp;&nbsp; NTRtScan.exe".&nbsp;&nbsp; &nbsp;&nbsp; 3. Open the "[Trend Micro folder]\OfficeScan Client\" folder and rename the "NTRtScan.exe.tmp" file to "NTRtScan.exe". 4. Start the NTRtScan service.
fr_fr: Cette tâche déploiera NTRtScan.exe version10.58.0.1016. Ce patch critique résout les problèmes suivants: Problème&nbsp;: Core Protection Module ne peut pas appliquer les mises à jour avec succès. Ce problème survient lorsque la fonction VSAPI «&nbsp;IOT_initializedeviceandscanengineex renvoie une erreur système occupé pendant le démarrage empêchant le service NTRtScan de démarrer dans certains clients.&nbsp;&nbsp; Solution&nbsp;: Le patch critique&nbsp;0001 ajoute un nouveau mécanisme de réessayage pour la fonction VSAPI «&nbsp;iot_initializedeviceandscanengineex&nbsp;» et permet à NTRtScan de retarder le processus de démarrage pendant qu'il attend que la fonction réussisse son démarrage. Ceci permet au service NTRtScan de démarrer sans problème et au Core Protection Module d'appliquer des mises à jour automatiques avec succès. [Installation]&nbsp;&nbsp; =====================================================================&nbsp;&nbsp; Pour installer ce patch critique: Exécutez ce fixlet pour déployer «&nbsp;NTRtScan.exe&nbsp;» version&nbsp;10.58.0.1016 sur les clients.&nbsp; L'ancien «&nbsp;NTRtScan.exe&nbsp;» est enregistré comme «&nbsp;NTRtScan.exe.tmp&nbsp;» dans le dossier «&nbsp;[Trend Micro]\OfficeScan Client\&nbsp;». Vous pouvez utiliser ce fichier de sauvegarde pour toute éventuelle rétrogradation. [Désinstallation]&nbsp;&nbsp; ===================================================================== Pour désinstaller le fixlet, supprimez-le manuellement avec la console Endpoint Security Platform. Pour rétrograder vers la version précédente de «&nbsp;NTRtScan.exe&nbsp;»&nbsp;:&nbsp;&nbsp; &nbsp;&nbsp; 1. Arrêtez le service NTRtScan.&nbsp;&nbsp; &nbsp;&nbsp; 2. Vérifiez si le fichier «&nbsp;[Trend Micro folder]\OfficeScan Client\NTRtScan.exe.tmp&nbsp;» existe. Si c'est le cas, supprimez le dossier «&nbsp;Trend Micro folder]\OfficeScan Client\NTRtScan.exe&nbsp;».&nbsp;&nbsp; &nbsp;&nbsp; 3. Ouvrez le dossier «&nbsp;[Trend Micro folder]\OfficeScan Client\&nbsp;» et renommez le fichier «&nbsp;NTRtScan.exe.tmp&nbsp;»en «&nbsp;NTRtScan.exe». 4. Démarrez le service NTRtScan.

source: This hot fix resolves the following issue:&nbsp;&nbsp; Issue:&nbsp;&nbsp;&nbsp; The Microsoft(TM) Windows(TM) Security Center on Windows Vista and&nbsp;Windows 7 does not&nbsp;recognize Core Protection Module 1.6 clients.Solution: Hot fix 0004 imports a custom fixlet for the Endpoint Security Platform to enable Core Protection Module 1.6 clients to report their status to the Windows Security Center/Action Center correctly. Installation:===================================================================== To install this hot fix: &nbsp;&nbsp; 1. Use the Endpoint Security Platform console to import the "CPM_Hotfix_0004.bes" fixlet as a custom fixlet. A new fixlet named "Core Protection Module - Windows Security Reporting Issue" is installed. &nbsp;&nbsp; 2. The fixlet automatically detects the computers that encounter the issue. Run the fixlet on these computers.
fr_fr: Ce correctif de type hotfix résout les problèmes suivants&nbsp;:&nbsp;&nbsp; Problème&nbsp;:&nbsp;&nbsp;&nbsp; Microsoft(TM) Windows(TM) Security Center sur Windows Vista et&nbsp;Windows 7 ne reconnaissent&nbsp;pas les clients 1.6 de Core Protection Module.Solution&nbsp;: Hot fix 0004 importe un fixlet personnalisé pour Endpoint Security Platform pour permettre aux clients 1.6 de Core Protection Module de signaler leur état correctement au Centre de sécurité /Centre de maintenance de Windows. Installation&nbsp;:=====================================================================&nbsp;&nbsp; Pour installer ce hot fix: &nbsp;&nbsp; 1. Utilisez la console de la plate-forme Sécurité des points finaux pour importer le fixlet "CPM_Hotfix_0004.bes" comme fixlet personnalisé. Un nouveau fixlet nommé "Core Protection Module - Windows Security Reporting Issue" est installé. &nbsp;&nbsp; 2. Le fixlet détecte automatiquement les ordinateurs qui rencontrent ce problème. Exécutez le fixlet sur ces ordinateurs.

source: {\cs5\f1\cf15\lang1024 This&nbsp;critical patchresolves the following issue: Issue: While migrating Trend Micro Core Protection Module(TM) (CPM) 1.6 to CPM Service Pack 1 for endpoints, the Web Reputation functions do not work on x64 platforms. Solution: Critical Patch 0002 provides a fixlet in the Trend Micro Core Protection Module site. Administrators can deploy this fixlet to resolve this issue. [Installation] ===================================================================== To install this critical patch: Run this fixlet to resolve the Web Reputation issue on x64 platforms. &nbsp;&nbsp; Note: Since this fixlet replaces some files, create backup files. The &nbsp; backup files are "libeay32.dll.tmp", "PccNTUpd.exe.tmp", &nbsp; "ssleay32.dll.tmp" and "TmpxHash.dll.tmp" from the "[Trend &nbsp; Micro folder]\OfficeScan Client\" folder. You can use these backup files if you need to do a rollback. [Uninstallation] ===================================================================== &nbsp;&nbsp; To uninstall the fixlet, manually remove the fixlet through the Endpoint Security Platform console. To roll back the files: &nbsp;&nbsp; 1. Stop these services in this order: TmListen, NTRtScan and TmAdptrsvr.&nbsp;&nbsp; &nbsp;&nbsp; 2. Check if the "libeay32.dll.tmp", "PccNTUpd.exe.tmp", "ssleay32.dll.tmp" and "TmpxHash.dll.tmp" files are in the "[Trend Micro folder]\OfficeScan Client\" folder. Once you find these files, remove the "libeay32.dll", "PccNTUpd.exe", "ssleay32.dll" and "TmpxHash.dll" files from the "[Trend Micro folder]\OfficeScan Client\" folder.&nbsp;&nbsp; &nbsp;&nbsp; 3. Open the "[Trend Micro folder]\OfficeScan Client\" folder and rename the following files: - From "libeay32.dll.tmp" file to "libeay32.dll" - From "PccNTUpd.exe.tmp" file to "PccNTUpd.exe" - From "ssleay32.dll.tmp" file to "ssleay32.dll" - From "TmpxHash.dll.tmp" file to "TmpxHash.dll". 4. Start these services in this order: TmAdptrsvr, NTRtScan and TmListen.
fr_fr: {\cs5\f1\cf15\lang1024 Ce patch critique résout les problèmes suivants: Problème&nbsp;: lors de la migration de Trend Micro Core Protection Module (TM)(CPM) 1.6 à CPM Service Pack1 pour les points finaux, les fonctions de Réputation des sites Web ne sont pas compatibles avec les plates-formes x64. Solution: le patch critique0002 fournit un fixlet sur le site Trend Micro Core Protection Module. Les administrateurs peuvent déployer cefixlet pour résoudre ce problème. [Installation] =====================================================================Pour installer ce patch critique: Exécutez ce fixlet pour résoudre le problème de Réputation de sites Web sur les plates-formes x64. Remarque&nbsp;: étant donné que ce fixlet remplace certains fichiers, créez des fichiers de sauvegarde. Les fichiers de sauvegarde sont «&nbsp;libeay32.dll.tmp&nbsp;», «&nbsp;PccNTUpd.exe.tmp&nbsp;», «&nbsp;ssleay32.dll.tmp&nbsp;» et «&nbsp;TmpxHash.dll.tmp» du dossier «Trend Micro\OfficeScan Client\». Vous pouvez utiliser ces fichiers de sauvegarde si vous devez effectuer une rétrogradation. [Désinstallation] =====================================================================Pour désinstaller le fixlet, supprimez-le manuellement avec la console Endpoint Security Platform. Pour rétrograder les fichiers: &nbsp;&nbsp; 1. Arrêtez ces services dans l'ordre suivant&nbsp;: TmListen, NTRtScan etTmAdptrsvr.&nbsp;&nbsp; &nbsp;&nbsp; 2. Vérifiez si les fichiers «&nbsp;libeay32.dll.tmp&nbsp;», «&nbsp;PccNTUpd.exe.tmp&nbsp;», «&nbsp;ssleay32.dll.tmp&nbsp;» et «&nbsp;TmpxHash.dll.tmp&nbsp;» se trouvent dans le dossier «&nbsp;Trend Micro\OfficeScan Client\&nbsp;». Une fois que vous avez trouvéces fichiers, supprimez «&nbsp;libeay32.dll&nbsp;», «&nbsp;PccNtUpd.exe&nbsp;», «&nbsp;ssleay32.dll&nbsp;» et «&nbsp;TmpxHash.dll&nbsp;» du dossier «&nbsp;Trend Micro\OfficeScan Client\&nbsp;».&nbsp;&nbsp; &nbsp;&nbsp; 3. Ouvrez le dossier «&nbsp;Trend Micro\OfficeScan Client\&nbsp;» et renommez les fichiers suivants: – «&nbsp;libeay32.dll.tmp&nbsp;» en «&nbsp;libeay32.dll&nbsp;» – «&nbsp;PccNTUpd.exe.tmp&nbsp;» en «&nbsp;PccNtUpd.exe&nbsp;» – «&nbsp;ssleay32.dll.tmp&nbsp;» en «&nbsp;ssleay32.dll&nbsp;» – «&nbsp;TmpxHash.dll.tmp&nbsp;» en «&nbsp;TmpxHash.dll&nbsp;».&nbsp;&nbsp; 4. Démarrez ces services dans l'ordre suivant: TmAdptrsvr, NTRtScan et TmListen.

source: Use this task to apply&nbsp;pattern updatesto Core Protection Module endpoints that have been configured for automatic updates. Important Note: This action requries that the endpointhas been configured to allow automatic updates using the 'Enable Automatic Updates - Endpoint' task.Additionally the server components must also have automatic updates configured andenabled. Important Note: You should set this action to run as a policy with reapplicability behavior.It is recommended you apply this Task with the following action parameters: never expire reapply whenever relevant retry up to 99 times on failure reapply an unlimited number of times If you do not set this action&nbsp;with the above settingsnew pattern sets will notbe automatically downloaded and applied by your endpoints.
fr_fr: Utilisez cette tâche pour appliquer les mises à jour de signatures aux points finaux de Core Protection Module qui ont été configurés de manière à recevoir des mises à jour automatiques. Remarque importante: Cette action requiert que le point final ait été configuré pour autoriser les mises à jour automatiques avec la tâche «&nbsp;Activer les mises à jour automatiques – Point final&nbsp;».En outre, les mises à jour automatiques doivent également être configurées et activées pour les composants du serveur. Remarque importante: Vous devriez paramétrer cette action afin qu'elle s'exécute comme stratégie avec un comportement de ré-applicabilité.Il est conseillé que vous appliquiez cette tâche avec les paramètres d'action suivants: n'expire jamais Réappliquer le cas échéant réessayer jusqu'à 99fois en cas d'échec réappliquer un nombre illimité de fois Si vous ne définissez pas cette action avec les paramètres ci-dessus, de nouveaux jeux de signatures ne seront pas automatiquement téléchargés et appliqués par vos points finaux.

source: The specified computers have&nbsp;Trend Micro&nbsp;Core Protection Module&nbsp;installed.&nbsp; Use this task to set the maximum number of the most recent suspiciousbehavior detections to be reported. The default maximum is the last 25suspiciousbehavior detections. Note: The valid values are between 0 ~ 2147483647. This action will set a default maximum value of 25&nbsp;ifthevalue is invalid.
fr_fr: Trend Micro Core Protection Module est installé sur les ordinateurs spécifiés. Utilisez cette tâche pour définir le nombre maximum des dernières détections de comportements suspects à signaler. Le nombre maximum par défaut sont les 25 dernières détections de comportements suspects. Remarque: Les valeurs valides sont comprises entre 0 et 2147483647. Cette action définira une valeur maximale par défaut de 25 si la valeur est incorrecte.

source: Use this task to upload&nbsp;Core Protection Module&nbsp;installation and uninstallation logs on endpoints that cannot install the Core Protection Module on endpoints. The following files are uploaded to the BES server: ClnExtor.log CPMInstall.log setupapi.app.log CPMInstallResult.log CPMsrvInstall.log TmInstall.log CPMsrvISSetup.log CPMISSetup.log OFCISSetup.log ComUnist.log OfcNT.log OfcMsi.log TMFilter.log setupapi.log app_list.txt registry_list.txt By default, the destination folder on the BES Server is: &lt;BES Server install directory&gt;\UploadManagerData\BufferDir\sha1\&lt;last 2 digits of BES client id&gt;\&lt;BES client id&gt; Note: Not all of the logs are uploaded. The logs that do upload depend on the installation status and type.For example, CPMsrvISSetup.log only exists when installing theCore Protection Moduleserver package. ComUnist.log only exists after an uninstallation is performed.
fr_fr: Utilisez cette tâche pour télécharger les journaux d'installation et de désinstallation de Core Protection Module sur des points finaux qui ne peuvent pas installer Core Protection Module sur des points finaux. Les fichiers suivants sont téléchargés sur le serveur BES&nbsp;: ClnExtor.log CPMInstall.log setupapi.app.log CPMInstallResult.log CPMsrvInstall.log TmInstall.log CPMsrvISSetup.log CPMISSetup.log OFCISSetup.log ComUnist.log OfcNT.log OfcMsi.log TMFilter.log setupapi.log app_list.txt registry_list.txt Par défaut, le dossier de destination sur le serveur BES est:&lt;répertoire d'installation du serveur BES&gt;\UploadManagerData\BufferDir\sha1\&lt;2&nbsp;derniers chiffres de l'ID client BES&gt;\&lt;ID client BES&gt; Remarque: tous les journaux ne sont pas téléchargés. Les journaux effectivement téléchargés dépendent de l'état et du type d'installation.Par exemple, CPMsrvISSetup.log existe uniquement lors de l'installation du pack serveur Core Protection Module. ComUnist.log n'existe qu'après une désinstallation.

source: Core Protection Module requires that certain services are running: OfficeScan&nbsp;NT Listener OfficeScanNT RealTime Scan Trend Micro Adapter Service OfficeScanNT Firewall (when CPM version &gt;=1.5and Common Firewall isenabled) Unauthorized Change Prevention Service Core Protection Module Data Protection Service Core Protection Module for Mac requires that certain services are running: iCorePluginMgr iCoreService The&nbsp;listed computers have one or more required service&nbsp;not running and/or configuredwith an incorrect start mode.
fr_fr: Core Protection Module requiert l'exécution de certains services: Service d'écoute d'OfficeScan NT Service de scan en temps réel d'OfficeScan NT Trend Micro Adapter Service Pare-feu d'OfficeScanNT (lorsque la version CPM &gt;= 1.5 et que le pare-feu commun est activé) Service de prévention des modifications non autorisées Service de protection des données de Core Protection Module Core Protection Module pour Mac requiert l'exécution de certains services: iCorePluginMgr iCoreService Les ordinateurs répertoriés ont un ou plusieurs services requis qui ne sont pas en cours d'exécution ou sont configurés avec un mode de démarrage incorrect.

source: This task is used to update the Client dashboard files to the latest version. Note: This task will not change the Client UI Tray Mode. If the Client UI Tray Mode is set to "OffersTray" Mode, the Client Dashboard will not be visible unless there is at least one offer available. Note: When the Client UI is visible, use CTRL-ALT-SHIFT-T to activate a second Technician dashboard with additional information. Note: This will replace any previous client dashboards you have may have already created Note: This will restart the BES Client. If you are deploying to a large number of endpoints, you should use the temporal distribution option to avoid all clients restarting at once. File Size:11 KB
fr_fr: Cette tâche sert à mettre à jour les fichiers du tableau de bord client à la dernière version. Remarque: Cette tâche ne modifiera pas le mode de la barre d'état de l'IU client. Si le mode de la barre d'état de l'IU client est en mode «&nbsp;OffersTray», le tableau de bord client ne sera pas visible, à moins d'une offre au moins soit disponible. Remarque: Lorsque l'IU client est visible, utilisez CTRL-ALT-MAJ-T pour activer une seconde tableau de bord technicien avec des informations complémentaires. Remarque: Ceci remplacera tous les éventuels tableaux de bord client que vous pourriez avoir déjà créés Remarque: Ceci redémarre le client BES. Si vous effectuez un déploiement à grande échelle sur un grand nombre de points finaux, vous devez utiliser l'option de distribution dans le temps pour éviter que tous les clients ne redémarrent simultanément. Taille du fichier:11ko

source: Use this task to enable a client dashboard which contains basic computer information, CPM info/statistics, as well as recently detected virus and spyware/grayware infections. This task sets the Client UI Tray Mode to "AlwaysTray". It will then copy the Client dashboard files to the necessary location on the endpoint. When the Client UI is visible, use CTRL-ALT-SHIFT-T to activate a second Technician dashboard with additional information. "AlwaysTray" Mode: In this mode, the UI always shows a tray icon, and clicking on the tray icon causes the Main Dialog to open. This mode is not compatible with the Main Dialog disabled setting. Note: Do not set the "Reapply" behavior when taking this action or you may cause endpoints to constantly reset this setting. Note: This will replace any previous client dashboards you may have already created Note: This will restart the BES Client. If you are deploying to a large number of endpoints, you should use the temporal distribution option to avoid all clients restarting at once. File Size:11 KB
fr_fr: Utilisez cette tâche pour activer un tableau de bord client qui contient des informations de base de l'ordinateur, des infos/statistiques sur CPM ainsi que les infections virales et spywares/graywares récemment détectées. Cette tâche définit le mode de la barre d'état de l'IU client sur «AlwaysTray». Elle copiera ensuite les fichiers du tableau de bord client à l'emplacement nécessaire sur le point final. Lorsque l'IU client est visible, utilisez CTRL-ALT-MAJ-T pour activer une seconde tableau de bord technicien avec des informations complémentaires. Mode «&nbsp;AlwaysTray»: Dans ce mode, l’IU affiche toujours une icône dans la barre d'état et un clic sur celle-ci ouvre la boîte de dialogue principale. Ce mode n'est pas compatible avec le paramètre qui désactive la boîte de dialogue principale. Remarque: Ne définissez pas le comportement «&nbsp;Réappliquer» lorsque vous exécutez cette action ou vous risquez de provoquer une réinitialisation constante de ce paramètre par les points finaux. Remarque: Ceci remplacera tous les éventuels tableaux de bord client que vous pourriez avoir déjà créés Remarque: Ceci redémarre le client BES. Si vous effectuez un déploiement à grande échelle sur un grand nombre de points finaux, vous devez utiliser l'option de distribution dans le temps pour éviter que tous les clients ne redémarrent simultanément. Taille du fichier:11ko

source: This task is used to set the Client UI Tray Mode to "OffersTray" mode. "OffersTray" Mode: In this mode, the tray behaves like it is in "AlwaysTray" mode if there is at least one offer available. Otherwise it behaves like it is in "ActionsTray" mode. This mode is not compatible with theMain Dialog disabled setting. Note: The dashboard files are not deleted from the endpoint. Note: Do not set the "Reapply" behavior when taking this action or you may cause endpoints to constantly reset this setting. Note: This will restart the BES Client. If you are deploying to a large number of endpoints, you should use the temporal distribution option to avoid all clients restarting at once.
fr_fr: Cette tâche sert à définir le mode de la barre d'état de l'IU client sur «&nbsp;OffersTray». Mode «&nbsp;OffersTray&nbsp;»: Dans ce mode, la barre d'état se comporte comme s'il était en mode «&nbsp;AlwaysTray&nbsp;» si au moins une offre est disponible. Sinon, il se comporte comme s'il était en mode «&nbsp;ActionsTray». Ce mode n'est pas compatible avec le paramètre qui désactive la boîte de dialogue principale. Remarque: Les fichiers de tableau de bord ne sont pas supprimés du point final. Remarque: Ne définissez pas le comportement «&nbsp;Réappliquer» lorsque vous exécutez cette action ou vous risquez de provoquer une réinitialisation constante de ce paramètre par les points finaux. Remarque: Ceci redémarre le client BES. Si vous effectuez un déploiement à grande échelle sur un grand nombre de points finaux, vous devez utiliser l'option de distribution dans le temps pour éviter que tous les clients ne redémarrent simultanément.

source: This task will clear the rollback flag from endpoints. When the rollback flag is set, clients will not apply any pattern updates. Use this action to re-enable pattern updates.
fr_fr: Cette tâche efface l'indicateur de rétrogradation des points finaux. Lorsque l'indicateur de rétrogradation est défini, les clients n'appliqueront pas les mises à jour de signatures. Utilisez cette action pour réactiver les mises à jour des signatures.

source: Core Protection Module requires the&nbsp;listed computers&nbsp;to reboot.&nbsp;The reboot may be&nbsp;required for several reasons, includingto clean up certain spyware/virus files which cannot be completely removed without a system restart, complete application of pattern files,or finish installation. Important Note: When running the action below, pay careful attention to the action deployment options in order to avoid restarting the computer at inappropriate times.
fr_fr: Core Protection Module requiert le redémarrage des ordinateurs spécifiés.Le redémarrage peut être nécessaire pour plusieurs raisons, notamment pour nettoyer certains fichiers de spywares/virus qui ne peuvent pas être complètement supprimés sans un redémarrage du système, l'application complète des fichiers de signatures ou pour terminer une installation. Remarque importante: Lors de l'exécution de cette action ci-dessous, faites attention aux options de déploiement de l'action afin d'éviter le redémarrage de l'ordinateur à des moments inopportuns.
